%将pos和index的顺序按照标准（systematic numbering)进行转换。

sn=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60];
pn=[7,13,9,1,5,4,8,19,20,26,34,23,32,25,18,16,10,3,2,6,11,14,22,31,27,38,47,50,41,44,51,46,37,28,35,24,15,12,21,17,29,33,40,42,53,55,60,56,58,52,45,43,36,30,39,48,49,59,57,54];

newPOS=zeros(60,3);
newIndex=zeros(60,120);
load('mat/c60/c60');

for ii=1:60
   newPOS(ii,:)=pos(pn(1,ii),:);
end

for i=1:60
   tmp=index_r(i,:);
   for j=1:120
     tmp(j)=sn(pn==index_r(i,j));
   end
   newIndex(i,:)=tmp;
end

newIndex=sortrows(newIndex,1);

newIndex=unique(newIndex','rows')';

